

#include <iostream>
using namespace std; 

int main()
{	
	//setlocale(LC_ALL, "rus");
	//int a = INT32_MAX;
	//int b = INT32_MIN;
	//long c = LONG_MAX;
	//long d = LONG_MIN;
	//short e = SHRT_MAX;
	//short f = SHRT_MIN;
	//unsigned g = UINT_MAX;
	//unsigned h = 0;
	//float k = FLT_MAX;
	//float l = FLT_MIN;
	//double m = DBL_MAX;
	//double n = DBL_MIN;
	//char o = 255; // max
	//char p = 0; // min 
	//bool q = 1; //max 
	//bool r = 0; //min 
	////cout << a << b << c << d << e << f << g << h << k << l << m << n << o << p << q << r;////
	//cout << "тип\t|\tколичество байт     |    \tmax\t     |    \tmin\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nint  \t|\t   " << sizeof(a) << "\t\t    |\t  " << a << "\t     |\t  "  <<  b << "\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nlong  \t|\t   " << sizeof(c) << "\t\t    |\t  " << c << "\t     |\t  " << d << "\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nshort  \t|\t   " << sizeof(e) << "\t\t    |\t  " << e << "\t\t     |\t  " << f << "\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nunsigned|\t   " << sizeof(g) << "\t\t    |\t  " << g << "\t     |\t\t  " << h << "\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nfloat  \t|\t   " << sizeof(k) << "\t\t    |\t  " << k << "\t     |\t  " << l << "\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\ndouble  |\t   " << sizeof(m) << "\t\t    |\t  " << m << "\t     |\t  " << n << "\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nchar  \t|\t   " << sizeof(o) << "\t\t    |\t\t  " << o << "\t     |\t  " << p << "\t\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";
	//cout << "\nbool  \t|\t   " << sizeof(q) << "\t\t    |\t\t  " << q << "\t     |\t  " << r << "\t\t     |";
	//cout << "\n--------------------------------------------------------------------------------------";

	int a,b,c ;
	cout << "input a: ";
	cin >> a;
	cout << "input b: ";
	cin >> b; 
	cout << "\n" << a << "+" << b << "=" << a + b;
	cout << "\n" << a << "-" << b << "=" << a - b;
	cout << "\n"  << a << "*" << b << "=" << a * b;
	cout << "\n"  << a << "/" << b << "=" << (float)a / b;

}

